Repository: wkfff/delphi-codes
Catalog: delphi-code/DelphiCodeToDoc/Source/Translations/*.po
Languages: fr_fr

source: Insert author's name here
fr_fr: Insérer le nom de l'auteur ici

source: Enter your project's summary in a single line
fr_fr: Entrer le résumé du projet sur une ligne

source: Enter your project's multilines description
fr_fr: Entrer la description multi-lignes du projet

source: The project [%s] has changed. Do you want to save these modifications ?
fr_fr: Le projet [%s] a changé. Enregistrer les modifications ?

source: (ReadOnly)
fr_fr: (Lecture seule)

source: Are you sure you want to cancel this wizard ?
fr_fr: Êtes-vous sûr de vouloir quitter cet expert ?

source: Root directory and Output directory must be filled !
fr_fr: Les répertoires racine et destination doivent être remplis !

source: This will delete all generated files in the folder %s Do you want to continue this action ?
fr_fr: Cela supprimera tous les fichiers générés dans le répertoire %s Voulez-vous continuer cette action ?

source: Wizard successfully create the project
fr_fr: L'expert a réussi à créer le projet

source: Wizard operation Canceled
fr_fr: Opérations de l'expert annulées

source: Successfully Checked the project, BUILD function is now enable
fr_fr: Vérification du projet réussie, la fonction CONSTRUIRE est activée

source: Project checking aborted
fr_fr: Vérification du projet annulée

source: Successfully build the Project
fr_fr: Construction du Projet réussie

source: Build done
fr_fr: Construction finie

source: Error while building the Project
fr_fr: Erreur pendant la construction du Projet

source: Launching browser to display result
fr_fr: Lance le browser pour afficher le résultat

source: Project configuration changed. You need to re-CHECK project
fr_fr: Configuration du projet changée. Vous devez re-vérifier le projet.

source: Project closed. To start a new project, try the NEW WIZARD PROJECT
fr_fr: Projet fermé. Pour commencer un nouveau projet, utiliser EXPERT NOUVEAU PROJET

source: Error while saving Project
fr_fr: Erreur lors de la sauvegarde du Projet

source: Error while loading Project
fr_fr: Erreur lors du chargement du fichier

source: Illegal call!
fr_fr: Appel illegal!

source: Using config file : %s
fr_fr: Utilise le fichier : %s

source: Usage : DCTD_cmd.exe ConfigFile.xml
fr_fr: Utilisation : DCTD_cmd.exe FichierDeConfiguration.xml

source: Project file was upgraded from a previous version
fr_fr: Le projet a été mis à jour à partir d'une version précédente
