Repository: wkfff/delphi-codes
Catalog: delphi-code/DelphiCodeToDoc/Source/Translations/*.po
Languages: fr_fr

source: About
fr_fr: A Propos

source: DelphiCodeToDoc is a free documentation
fr_fr: DelphiCodeToDoc est un outil gratuit

source: system for Delphi, released under the GNU
fr_fr: de documentation pour Delphi, diffusé sous GNU

source: General Public License. It uses information
fr_fr: General Public License. Il utilise les informations

source: about source code symbols and formatted
fr_fr: des symboles du code source et des commentaires

source: comments in files to produce accurate
fr_fr: formatés des fichiers pour produire une documentation

source: documentation from your application and
fr_fr: fidèle de votre application et de

source: component.
fr_fr: votre composant.

source: Full project can be found at :
fr_fr: Le projet complet est disponible ici :

source: DelphiCodeToDoc is a free documentation system for Delphi, released under the GNU
fr_fr: DelphiCodeToDoc est un outil de documentation gratuit pour Delphi, diffusé sous la lience GNU

source: General Public License. It uses information about source code symbols and formatted comments in files to
fr_fr: General Public Licence. It utilise les informations des symboles du code source et les commentaires formattés des fichiers pour

source: produce accurate documentation from your application and component.
fr_fr: produire une documentation fidèle de votre application ou composant.

source: How to use ?
fr_fr: Comment utiliser ?

source: Select the 'Project Wizard', enter directory where you have source code.
fr_fr: Selectionner 'Expert Projet', entrer le répertoire contenant le code source.

source: It will show you the 'Configuration' panel where you can change options.
fr_fr: S'affichera alors le panneau de 'Configuration' où vous pouvez changer les options.

source: Select the 'Check' command to verify if the parser understand you files.
fr_fr: Selectionner la commande 'Vérifier' pour voir si le parser comprends vos fichiers.

source: Then, select 'Build' to build the documentation.
fr_fr: Ensuite, selectionner 'Construire' pour construire la documentation.

source: Have fun !
fr_fr: Amusez-vous bien !

source: IMPORTANTAbout ALPHA revisions :
fr_fr: IMPORTANT à propos des version ALPHA :

source: This (alpha) version is under development, so there are many things restricted or under construction.
fr_fr: Cette version (alpha) est en developpement, il y a donc des restrictions ou des choses en construction.

source: You can go to the project page and submit bug/issue/idea, I will be pleased.
fr_fr: Vous pouvez visiter la page du projet et soumettre bug/problem/idées, je serais ravi.

source: JavaDoc (implemented and functional)
fr_fr: JavaDoc (implémenté et fonctionnel)

source: This system came from Sun, and is used in many programming language. It is a rich and simple syntax, well supported
fr_fr: Ce système vient de SUN, utilisé dans de nombreux langage de programmation. C'est une syntaxe simple et riche, supporté

source: by many software.
fr_fr: par beaucoups de logiciel.

source: For this syntax, you can define a prefix in order to specify a special comment (as the '*' in /** ...*/ in Java)
fr_fr: Pour cette syntaxe, vous pouvez définir un préfixe spécifiant un commentaire spécial (comme '*' dans /**...*/ en Java)

source: List of supported TAGs:
fr_fr: Liste des TAGs supportés:

source: *Description (no '@' TAG!)
fr_fr: *Description (pas de TAG '@' !)

source: *@see (Not functional for the moment in DelphiCodeToDoc)
fr_fr: *@see (Non implémenté)

source: Inlines (implemented and functional)
fr_fr: Inlines (implementé and fonctionnel)

source: This is a simple extention of JavaDoc system, which provide the description TAG facility with double slash comment.
fr_fr: C'est une simple extension du système JavaDoc, qui fournit un TAG de description par un commentaire double slash.

source: Writting a comment line with double slash ( // ) before a class, field or method will be processed as a Description TAG.
fr_fr: Ecrire une ligne de commentaire avec double slash ( // ) avant une class, un champ ou une méthode sera assimilé à un TAG de description.

source: End of line Inline
fr_fr: Fin de ligne Inline

source: Writting a comment line at the end of a line with double slash ( // ) before a field (and only a Field) will be processed as
fr_fr: Ecrire un commentaire de fin de ligne avec double slash ( // ) après unchamp (et seulement un champ) sera assimilé à

source: a Description TAG for the preceding Field.
fr_fr: un TAG de description pour le champ précédent.

source: You must Check the project to have access to this screen.
fr_fr: Vous devez Vérifier le projet pour avoir accès à cet écran.

source: Debug Messages:
fr_fr: Messages de Debug:

source: User Messages:
fr_fr: Messages Utilisateur:

source: &New Full Wizard Project
fr_fr: Expert nouveau project

source: &Open Project
fr_fr: &Ouvrir un Projet

source: &Save Project
fr_fr: &Enregistrer le Projet

source: &Check and Build
fr_fr: &Vérifier et Construire

source: &View Output
fr_fr: &Voir la documentation

source: &Purge Output Folder
fr_fr: &Purger le répertoire de destination

source: &New Empty Project
fr_fr: &Nouveau Projet vide

source: N&ew Quick Wizard Project
fr_fr: Expert Rapide N&ouveau Projet

source: &Save As
fr_fr: Enregistrer &sous...

source: S&ave Project
fr_fr: Enregistrer le Projet

source: &File
fr_fr: &Fichier

source: &Add Files
fr_fr: A&jouter des fichiers

source: &Check Project
fr_fr: &Vérifier le Projet

source: &Build Project
fr_fr: &Construire le Projet

source: &Project
fr_fr: &Projet

source: &Project Files
fr_fr: F&ichiers du Projet

source: &Reference
fr_fr: &Références

source: &View
fr_fr: &Vue

source: &About
fr_fr: &A Propos

source: &Help
fr_fr: &Aide

source: Ne&w Full Wizard Project
fr_fr: Expert Complet Nouveau Projet

source: &Import old Project
fr_fr: &Importer un ancien projet

source: S&ave As
fr_fr: E&nregistrer sous

source: &Close
fr_fr: &Fermer

source: F&ile
fr_fr: Fichier

source: C&heck and Build
fr_fr: Vé&rifier et Construire

source: &Tag Quality
fr_fr: &Qualité des Tags

source: C&lear Messages
fr_fr: E&ffacer les messages

source: &Languages
fr_fr: &Langues

source: File
fr_fr: Fichier

source: New Empty Project
fr_fr: Nouveau projet vide

source: Create a new empty project
fr_fr: Créer un nouveau projet vide

source: New Quick Wizard Project
fr_fr: Expert Rapide Nouveau Projet

source: Create a new project with help of the Wizard
fr_fr: Crée un nouveau projet avec l'aide de l'expert

source: New Full Wizard Project
fr_fr: Expert Complet Nouveau Projet

source: Open Project
fr_fr: Ouvre un projet

source: Open an existing project
fr_fr: Ouvre un projet existant

source: DCTD Project file (*.xml)|*.xml
fr_fr: DCTD fichier Projet (*.xml)|*.xml

source: Import old Project
fr_fr: Importe un ancien Projet

source: Import an old *.DCD extension project filename
fr_fr: Importer un ancien fichier projet d'extension *.DCD

source: DCTD Project file (*.dcd)|*.dcd
fr_fr: DCTD fichier Projet (*.dcd)|*.dcd

source: Save Project
fr_fr: Enregistre un projet

source: Save active project
fr_fr: Enregistre le projet actif

source: Save As
fr_fr: Enregistrer sous

source: Save project as a different name
fr_fr: Sauvegarder le projet sous un nom different

source: DCTD Project file|*.xml
fr_fr: DCTD fichier Projet |*.xml

source: Select file to save project
fr_fr: Selectionner le fichier de sauvegarde du projet

source: Close
fr_fr: Fermer

source: Close current project
fr_fr: Ferme le projet courant

source: E&xit
fr_fr: &Quitter

source: Exit|Quits the application
fr_fr: Quitter|Quitte l'application

source: Help
fr_fr: Aide

source: Display some informations about the product, the revision number and the author
fr_fr: Affiche les informations du produits, la version et l'auteur

source: Project
fr_fr: Projet

source: Add Files
fr_fr: Ajouter des fichiers

source: Add files to the current project
fr_fr: Ajoute des fichiers au projet courant

source: Check Project
fr_fr: Vérifier le Projet

source: Verify the files in the project, and build the references
fr_fr: Vérifie les fichiers du projet et construit les références

source: Build Project
fr_fr: Construire le Projet

source: Build project in the format you have configure
fr_fr: Construit le projet dans le format configuré

source: View
fr_fr: Vue

source: Show application informations, advice and links to various ressources.
fr_fr: Affiche les informations de l'application, conseils et divers liens.

source: Show application, input and output configuration
fr_fr: Affiche la configuration de l'application, les paramètres d'entrée et de sortie

source: Project Files
fr_fr: Fichiers du projet

source: Show and manage files in project
fr_fr: Affiche et gère les fichiers du projet

source: Reference
fr_fr: Références

source: Show references found in project as classes, types ...
fr_fr: Affiche les références trouvées dans le projet, comme les classes, types etc ...

source: Show all messages from the application concerning the process
fr_fr: Affiche les messages du déroulement de l'application

source: Tag Quality
fr_fr: QUalité des Tags

source: Show statistics about Tag coverage
fr_fr: Affiche les statistiques de la couverture de Tag

source: Languages
fr_fr: Langues

source: Check and Build
fr_fr: Vérifier et Construire

source: Check Project and then build the documentation
fr_fr: Vérifie le projet et ensuite construit la documentation

source: View Output
fr_fr: Voir la documentation

source: View output documentation
fr_fr: Voir la documentation générée

source: Purge Output Folder
fr_fr: Purge le répertoire de sortie

source: Purge existing documentation in output folder
fr_fr: Purger la documentation existante dans le répoertoire de destination

source: Clear Messages
fr_fr: Effacer les messages

source: New Project Wizard
fr_fr: Expert Nouveau Projet

source: To &Start Page
fr_fr: &Première Page

source: To &Last Page
fr_fr: &Dernière Page

source: < &Back
fr_fr: < Retour

source: &Next >
fr_fr: &Suivant >

source: &Finish
fr_fr: &Fin

source: Cancel
fr_fr: Annuler

source: Welcome
fr_fr: Bienvenue

source: Welcome to the new project wizard. It will helps you to create a new project step by step.
fr_fr: Bienvenue dans l'expert nouveau projet. Il vous aidera à créer un nouveau projet pas à pas.

source: Press the "Next" button and fill all screens with your informations about your project.
fr_fr: Appuyez sur le bouton "Suivant" et remplissez les écrans avec les informations de votre projet.

source: Describe your project
fr_fr: Décrire votre pojet

source: Enter the project name below. This name is the base filename and is used for the title of the documentation. Try something very short, a single word is the best solution
fr_fr: Entrez le nom du projet ci-dessous. C'est la base du nom du fichier et il est utilisé pour le titre de la documentation. Trouvez quelque-chose de court, un seul mot est la meilleure solution.

source: Enter the project summary below. The summary is display in the first page of the documentation. Try to explain in few words what is your project.
fr_fr: Entrez le resumé du projet ci-dessous. Le résumé est affiché sur la première page de la documentation. Essayez d'expliquer en quelques mots ce qu'est ce projet.

source: Enter the project description below. It is display in the first page of the documentation. Try to explain in few lines what the project is doing and why.
fr_fr: Entrez la description du projet ci-dessous. Celle-ci est afficher sur la première page de la documentation. Essayez d'expliquer en quelques lignes ce que fait le projet et pourquoi.

source: Enter the author of the documentation. If there is multiple author, list all authors in a single line.
fr_fr: Entrez l'auteur de la documentation. S'il y en a plusieurs, les lister sur une seule ligne.

source: Enter the copyright line that will be displayed in the bottom on each page of the documentation. You can add HTML tag if you want.
fr_fr: Entrer la ligne de copyright qui sera affichée en bas de chaque page de la documentation. Les balises HTML sont autorisées.

source: Files
fr_fr: Fichiers

source: Add source files to the project
fr_fr: Ajoute des fichiers au projet

source: List items to include or exclude
fr_fr: Listez les objets à inclure ou exclure

source: Include List
fr_fr: Liste d'inclusion

source: Exclude List
fr_fr: Liste d'exclusion

source: Add item to current list
fr_fr: Ajoute l'objet à la liste courante

source: Modify selected item
fr_fr: Modifier l'objet sélectionné

source: Delete selected item
fr_fr: Supprimer l'objet sélectionné

source: Add source files or project files to the project. Select a directory or a file, and click the Add button.
fr_fr: Ajoutez des fichiers source ou des fichiers projet. Sélectionnez un répertoire ou un fichier, et cliquez sur le bouton Ajouter.

source: Two lists controls where to search or ignore files.
fr_fr: Deux listes contrôlent ou chercher ou ignorer les fichiers.

source: Select a file
fr_fr: Selectionne un fichier

source: Select a folder
fr_fr: Sélectionne un répertoire

source: Recurse directories
fr_fr: Répertoires récursifs

source: You can use wilcard to select files and / or folders. Examples : *visit*.pas, MyDir\temp*.pas, *OtherSources*
fr_fr: Vous pouvez utiliser un joker pour selectionner les fichiers et / ou les répertoires. Exemples : *visit*.pas, MyDir\temp*.pas, *OtherSources*

source: Absolute and relative files and folders are allowed.
fr_fr: Les fichiers et répertoires absolus ou relatifs sont autorisés

source: Comments
fr_fr: Commentaires

source: Choose which comment system are used in your files
fr_fr: Choisir quel système de commentaire est utilisé dans vos fichiers

source: Parse implementation section
fr_fr: Analyse la section Implementation

source: Comment systems
fr_fr: Systèmes de commentaire

source: Support JavaDoc syntax
fr_fr: Support de la syntaxe JavaDoc

source: Support Inline syntax
fr_fr: Support de la syntaxe Inline

source: Support XMLDoc syntax
fr_fr: Support de la syntaxe XMLDoc

source: Support JEDI syntax
fr_fr: Support de la syntaxe JEDI

source: Allow Html code in Description
fr_fr: Autorise du code Html dans la description

source: Comments rules
fr_fr: Règles de commentaires

source: If no description found for properties, get assessors comment
fr_fr: Si aucune description pour les propriétés, prendre le commentaire de l'accesseur

source: If no comments found for overriden methods, get it from ancestor
fr_fr: Si aucun commentaire pour les méthodes surchargées, le copier de son ancêtre

source: Configure JavaDoc syntax
fr_fr: Configurer la syntaxe JavaDoc

source: JavaDoc Prefix
fr_fr: Prefixe JavaDoc

source: Bracketstar Prefix (*
fr_fr: Prefixe BracketStart (*

source: Curly Prefix {
fr_fr: Prefixe Curly {

source: Inline Prefix //
fr_fr: Prefixe Inline //

source: Skip first line in block comment
fr_fr: Ignore la première ligne dans le block de commentaire

source: Skip last line in block comment
fr_fr: Ignore la dernière ligne dans le block de commentaire

source: Configure XMLDoc syntax
fr_fr: Configurer la syntaxe XMLDoc

source: Output Format
fr_fr: Format de sortie

source: Define the style of the generated documentation
fr_fr: Définir le style de la documentation générée

source: Alpha sort of members
fr_fr: Tri alphabétique des members

source: Documentation language
fr_fr: Langue de la documentation

source: Member visibility filter
fr_fr: Filtre de visibilité des membres

source: Private
fr_fr: Privé

source: Protected
fr_fr: Protégé

source: Published
fr_fr: Publié

source: Automated
fr_fr: Automatisé

source: Output category filter
fr_fr: Filtre de la catégorie de sortie

source: Constants
fr_fr: Constantes

source: Functions
fr_fr: Fonctions

source: Fields
fr_fr: Champs

source: Properties
fr_fr: Propriétées

source: Events
fr_fr: Evenements

source: Units
fr_fr: Unités

source: View documentation after build
fr_fr: Voir la documentation après génération

source: Output directory (Absolute or relative)
fr_fr: Répertoire de sortie (Absolu ou relatif)

source: None (no output)
fr_fr: Aucun (pas de sortie)

source: Display hidden items (not in interface section)
fr_fr: Afficher les objets vachés (pas dans la section interface)

source: HTML output
fr_fr: Sortie HTML

source: Configure HTML documentation
fr_fr: Configure la documentation HTML

source: CSS Configuration
fr_fr: Configuration CSS

source: Use custom CSS file
fr_fr: Utilise une configuration CSS personnelle

source: Use internal CSS configuration
fr_fr: Utilise une Configuration CSS interne

source: Hide empty block
fr_fr: Cacher un block vide

source: Hide empty TAG section
fr_fr: Cache une section TAG vide

source: Warn when a TAG is empty
fr_fr: Prevenir en cas de TAG vide

source: CHM output
fr_fr: Sortie CHM

source: Configure CHM documentation
fr_fr: Configure la documentation CHM

source: TEXT output
fr_fr: Sortie TEXT

source: Configure TEXT documentation
fr_fr: Configure la documentation TEXT

source: PDF output
fr_fr: Sortie PDF

source: Configure PDF documentation
fr_fr: Configure la documentation PDF

source: HLP output
fr_fr: Sortie HLP

source: Configure HLP documentation
fr_fr: Configure la documentation HLP

source: Advanced
fr_fr: Avancé

source: Advanced options
fr_fr: Options avancées

source: Symbols referenced in conditional compiler directives (one per line)
fr_fr: Symboles référencés dans les directives de compilation (une par ligne)

source: Finish
fr_fr: Finir

source: End of the wizard
fr_fr: Fin de l'expert

source: Select the 'Finish' button to end this wizard.
fr_fr: Selectionner le bouton 'Finir' pour terminer cet expert.

source: Delphi Files (*.pas; *.dpr)|*.pas;*.dpr
fr_fr: Fichiers Delphi (*.pas; *.dpr)|*.pas;*.dpr

source: Select a Delphi source file
fr_fr: Selectionner un fichier source Delphi

source: Select a folder containing source files
fr_fr: Selectionnez un répertoire contenant des fichiers source

source: Project Wizard
fr_fr: Expert Projet

source: Enter the folder of your source files
fr_fr: Entrer le répertoire de vos fichiers source

source: Enter the output directory
fr_fr: Entrer le répertoire de destination

source: Enter the name of your project
fr_fr: Entrer le nom de votre projet

source: Enter the location of your project file (*.dpr)
fr_fr: Entrer le chemin de votre fichier projet (*.dpr)

source: Select a Delphi Project file (*.dpr)
fr_fr: Sélectionner un fichier Projet Delphi (*.dpr)

source: Select a folder with source files (*.pas)
fr_fr: Sélectionner un répertoire avec des fichiers source (*.pas)

source: Quick Wizard : Enter your project information
fr_fr: Expert rapide : Entrez les informations de votre projet

source: Delphi project file (*.dpr)|*.dpr
fr_fr: Fichier Projet Delphi (*.dpr)|*.dpr

source: Generating Unit : %s
fr_fr: Génère l'unité : %s

source: Building CHM project files
fr_fr: Construit les fichiers du projet CHM

source: Compiling CHM file
fr_fr: Compile le fichier CHM

source: Please, wait while building the CHM file
fr_fr: Veuillez patienter pendant la création du fichier CHM

source: #UnderConstruction#
fr_fr: #EnConstruction#

source: Todo
fr_fr: A faire

source: Links
fr_fr: Liens

source: Unit
fr_fr: Unité

source: Class
fr_fr: Classe

source: Constant
fr_fr: Constante

source: Function
fr_fr: Fonction

source: Class Hierarchy
fr_fr: Hierarchie de class

source: Class Tree
fr_fr: Arbre des Classes

source: Related Unit
fr_fr: Unité relative

source: Members
fr_fr: Membres

source: Field
fr_fr: Champ

source: Property
fr_fr: Propriétée

source: Event
fr_fr: Evenement

source: Symbol
fr_fr: Symbole

source: Legend
fr_fr: Légende

source: Visibility
fr_fr: Visibilité

source: Member
fr_fr: Membre

source: Related Class
fr_fr: Class relative

source: Source code
fr_fr: Code source

source: Parameters
fr_fr: Paramètres

source: Parameter
fr_fr: Paramètre

source: Return
fr_fr: Retour

source: Content
fr_fr: Contenu

source: Previous
fr_fr: Précédent

source: Next
fr_fr: Suivant

source: Additionnal Comments
fr_fr: Commentaires additionnels

source: Read Access
fr_fr: Accès en lecture

source: Write Access
fr_fr: Accès en écriture

source: Exports
fr_fr: Export

source: Building PDF project files
fr_fr: Construit les fichiers du projet PDF

source: Please, wait while building the PDF file
fr_fr: Veuillez patienter pendant la création du fichier PDF

source: #No TAG found in source code#
fr_fr: #Pas de TAG trouvé dans le code source#

source: Parsing file : %s
fr_fr: Analyse le fichier : %s

source: Output Directory purged
fr_fr: Répertoire de destination purgé

source: Nothing to purge
fr_fr: Rien à purger

source: Included Item not found : %s
fr_fr: Objet inlu non trouvé : %s

source: Nothing to parse, list is empty
fr_fr: Rien à analyser, liste vide

source: Ignoring item : %s
fr_fr: Ignore l'item %s

source: Bools as Checks
fr_fr: Booléens en Coches

source: Project's Name
fr_fr: Nom du Projet

source: Project's Title
fr_fr: Titre du Projet

source: Project's Summary
fr_fr: Résumé du Projet

source: Project's Description
fr_fr: Description du Projet

source: Project's Author
fr_fr: Auteur du Projet

source: HTML Link
fr_fr: Lien HTML

source: Author's Copyright
fr_fr: Copyright de l'Auteur

source: Recurse Directory
fr_fr: Répertoires récursifs

source: Conditional Defines
fr_fr: Definitions conditionnelles

source: Custom Header
fr_fr: Haut de page personnalisé

source: Custom Footer
fr_fr: Bas de page personnalisé

source: Documentation Language
fr_fr: Langue de la documentation

source: Output Folder
fr_fr: Répertoire de sortie

source: Comment syntax recognition
fr_fr: Reconnaissance syntaxique des commentaires

source: Launch Browser after Build?
fr_fr: Lance le browser après la construction ?

source: Warn when TAG are empty
fr_fr: Prevenir en cas de TAG vide

source: Hide empty TAG section from report
fr_fr: Cache une section TAG vide du rapport

source: Skip first TAG line in comment block
fr_fr: Ignore la première ligne de TAG dans le block de commentaire

source: Skip last TAG line in comment block
fr_fr: Ignore la dernière ligne de TAG dans le block de commentaire

source: Parse Implementation Section
fr_fr: Analyse la section Implementation

source: Hide empty block from report
fr_fr: Cacher un block vide du rapport

source: Output Filtering Category
fr_fr: Filtre de Catégorie en Sortie

source: Included Files list
fr_fr: Liste de fichiers inclus

source: Excluded Files list
fr_fr: Liste de fichiers exclus

source: Allow Html in Description
fr_fr: Autorise du code Html dans la description

source: Get (undocumented) method comments from assessors
fr_fr: Prendre les commentaires des méthodes (non documentée) des accesseurs

source: Display hidden items (defined in implementation only)
fr_fr: Montrer les objets cachés (définis uniquement dans l'implémentation)

source: Get overriden method comment from ancestor
fr_fr: Copier les commentaire des méthodes surchargées de leur ancêtre

source: Css Configuration
fr_fr: Configuration CSS

source: Custom CSS file
fr_fr: Fichier CSS personnalisé

source: Application options
fr_fr: Options de l'Application

source: Input options
fr_fr: Options d'entrée

source: Output options
fr_fr: Options de sortie

source: JavaDoc support options
fr_fr: Option du support JavaDoc

source: JavaDoc Prefix (only one character)
fr_fr: Préfixe JavaDoc (un seul caractère)

source: Files and folders list
fr_fr: Liste de fichiers et de répertoires

source: Comment Rules
fr_fr: Règles de commentaires

source: Project upgraded
fr_fr: Projet mis à jour

source: The file is not compatible with this application revision
fr_fr: Le fichier n'est pas compatible avec cette version de l'application

source: Insert your project's title here
fr_fr: Insérer le titre du projet ici
