{*******************************************************************************}
{                                                                              }
{       单元名称: XMConsts.pas                                                   }
{       创建日期: 2005-10-17                                                   }
{       摘要说明:附带程序公用文件                         }
{                                                                              }
{       详细说明:                                                              }
{                                                                              }
{       参　　阅:                                                              }
{                                                                              }
{       已知问题:                                                              }
{                                                                              }
{       待作事项:                                                              }
{                                                                              }
{                                              }
{                                  }
{                                                         }
{       当前版本:                                                              }
{       版本历史:                                                              }
{                                                                              }
{*******************************************************************************}
unit XMConsts;

interface

uses classes, sysutils, Graphics;

function GetAppTitle(ID: Integer; ISCore: Boolean): string;
var

  sDiv: string = ' -- ';
  // 标准
//{$IFDEF GB2312}
  sAuthor: string = '';
  sBookName: string = '';
  sAuthorEmail: string = '';
  sStudio: string = '';
  sCore: string = '';
  sExp: string = '';
  // {$ELSE}
    { sAuthor: string = '';
     sBookName: string = '';
     sAuthorEmail: string = '';
     sStudio: string = '';
     sCore: string = '';
     sExp: string = '';   }
  // {$ENDIF}

     // 提示 ======================================================================
     // 本地化字符串
     //============================================================================

{$IFDEF GB2312}
  sInformation: string = '提示';
  sWarning: string = '警告';
  sError: string = '错误';
  sEnabled: string = '有效';
  sDisabled: string = '禁用';
  sMsgDlgOK: string = '确认(&O)';
  sMsgDlgCancel: string = '取消(&C)';
{$ELSE}
  sInformation: string = 'Information';
  sWarning: string = 'Warning';
  sError: string = 'Error';
  sEnabled: string = 'Enabled';
  sDisabled: string = 'Disabled';
  sMsgDlgOK: string = '&OK';
  sMsgDlgCancel: string = '&Cancel';
{$ENDIF}

  // 实例名称
  ArrCoreExp: array[1..50] of string = ('多文档程序', '编程实现不规则窗口',
    '编程实现不规则窗口', '程序启动画面', '在窗口标题栏中使用自绘按钮',
    '列表框之间拖放', '文件管理器', '搜索文件', '读写INI文件', '加密解密器',
    '文件切割器', '将IE收藏夹导出为HTML文件', '网络聊天室', 'Ping操作的实现',
    '信使服务', '获得局域网计算机列表', '动态改变DNS地址', '网络资源树形浏览',
    'ADO技术', '捕捉异常', 'SQL查询', '彩色数据表格', 'TreeView显示数据库信息',
    '搜索Access数据库', '播放动画', '图片浏览器', 'CD播放器',
    '打造自己的RM播放器', '简单录音机', '综合多媒体播放器', '桌面晃动',
    'OpenGL编程', '制作图表', '图片的显示特效', '小画笔', '图像滤镜运算器',
    '贪吃蛇', '拼图游戏', '俄罗斯方块', '获得系统信息', '放大镜',
    '托盘程序', '禁止程序二次运行', '高精度计时器', '创建控制面板项', '',
    '', '',
    '', '');
  ArrExtExp: array[1..130] of string = ('实现文字颜色渐变效果',
    '实现颜色渐变窗体', '实现颜色渐变的进度条', '制作透明窗体',
    '制作任意拖动窗体', '制作倾斜文字', '滚动标题栏文字', '制作超级链接文字',
    '如何给窗体边框加颜色', '实现分割窗体', '制作颜色下拉框', '制作标题栏按钮',
    '按钮中的文字竖着显示', '查找列表框中的内容', '实现爆炸窗体的效果',
    '文件编辑器', '建立Internet快捷方式', '利用内存映射实现文件操作',
    '递规法搜索目录中的文件', '获得扩展名关联的应用程序',
    '修改文件的创建时间和修改时间', '获取文件属性', '将文件删除到回收站中',
    '清空回收站', '创建和删除文件夹', '更改文件的扩展名', '获取驱动器容量',
    '检测驱动器类型', '取得计算机所在工作组名称', '映射网络驱动器',
    '读取网卡的ID', '编写WWW浏览器', '建立拨号连接', '修改本地计算机名',
    '获取本机IP', '根据IP得到主机名称', '取得系统端口', '检索网址',
    '添加BDE别名', '获得BDE的系统信息', '复制记录',
    '取得当前的记录数', '创建和原始表相同的新表', '转换数据库',
    '将图片导入到数据库中', '用ADO动态浏览数据', '在DBGrid控件中显示图片',
    '动态创建和删除字段', '将字段中的内容导入ListBox',
    '将数据库中的内容添加到OutLine中', '修改DBGrid控件中指定行的颜色',
    'MTS缓冲池技术', '全屏播放电影', '判断光驱中是否有CD', '禁止光驱的自动播放',
    '显示声音属性设置窗口', '弹出和关闭光驱', '播放Flash动画', '图片放大',
    '浏览大图片', '颠倒图片', '绘制正弦曲线', '实现图片的拉伸效果',
    '彩色图片转化为黑白', '屏幕抓图', '实现控件的阴影效果', '图像文件的压缩',
    '双缓冲技术动画', '拯救地球', '隐藏任务栏', '窗口始终在最前面',
    '枚举系统正在运行的程序', '调用Windows程序', '修改系统菜单',
    '禁止窗体右上角的按钮', '多线程应用程序', '程序间传递数据',
    '按键控制Memo控件的滚动', '得到密码编辑框中的密码',
    '控制鼠标移动', '生成文件的快捷方式', '超级鼠标', '修改程序的图标',
    '动态生成数字按钮', '检测Shift、Alt和Ctrl键是否被按下',
    '更改光标的闪烁速度', '模拟按键', '记录屏幕操作',
      '在系统中使用组合键启动记事本', '限制鼠标移动范围',
    '', '', '', '', '', '', '', '',
    '', '', '', '', '', '', '', '', '', '', '', '',
    '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '',
    '');

implementation

{-------------------------------------------------------------------------------
  过程名:    GetAppTitle
  作者:      Administrator
  日期:      2003.12.18
  参数:      ID: Integer; ISCore: Boolean
  说明:	     返回每一个例程的标题
  返回值:    string
-------------------------------------------------------------------------------}

function GetAppTitle(ID: Integer; ISCore: Boolean): string;
begin
  if ISCore then
  begin
    Result :=  ArrCoreExp[ID];
  end
  else
  begin
    Result := ArrCoreExp[ID];
  end;
end;
end.

